# ============================================================
# Homebrew Brewfile（Nix併用環境向け）
# ============================================================
#
# 【管理方針】
# - CLIツール: Nix管理（再現性・クロスプラットフォーム）
# - GUIアプリ: Homebrew管理（macOS統合）
# - フォント: Homebrew管理（GUIアプリと同様）
#
# 【使い方】
# brew bundle --file=~/.config/nix-config/Brewfile
#
# ============================================================

# ------------------------------------------------------------
# tap（外部リポジトリ）
# ------------------------------------------------------------

# macOS向けツール（SketchyBar, skhd等）
tap "felixkratz/formulae"
tap "koekeishiya/formulae", "https://github.com/koekeishiya/homebrew-formulae.git"

# App Store CLI管理
tap "argon/mas"

# Brewfile管理ツール
tap "homebrew/bundle"

# サービス管理
tap "homebrew/services"

# その他（必要に応じて）
tap "steipete/tap"  # iMessageツール等

# ------------------------------------------------------------
# brew（CLIツール）- 最小限のみ
# ------------------------------------------------------------

# App Store アプリ管理（Nixにない）
brew "mas"

# macOS専用のウィンドウマネージャー・ステータスバー（Nixにない）
brew "felixkratz/formulae/sketchybar"  # カスタムステータスバー
brew "koekeishiya/formulae/skhd"       # ホットキーデーモン

# iMessage / Reminders CLI（macOS専用、Nixにない）
brew "steipete/tap/imsg"      # iMessage送受信
brew "steipete/tap/remindctl" # Apple Reminders操作

# 【削除候補】以下は全てNixで管理可能
# ❌ tree, fzf, jq, git, gh, curl, wget - Nix管理済み
# ❌ direnv, tmux, ranger - Nix管理済み
# ❌ ansible, awscli, terraform - 必要ならmise/Nixで
# ❌ anyenv, node-build - mise移行済み
# ❌ python@3.x - mise管理
# ❌ ruby, cocoapods - 必要ならmise管理
# ❌ 依存ライブラリ系（ca-certificates, openssl等） - 自動解決される

# ------------------------------------------------------------
# cask（GUIアプリケーション）
# ------------------------------------------------------------

# パスワード管理
cask "1password"
# ❌ 1password-cli - Nix管理済み（common.nixで_1password-cli）

# ブラウザ・通信
cask "google-chrome"
cask "microsoft-teams"
cask "slack"
cask "discord"
cask "zoom"

# 開発ツール
cask "visual-studio-code"
cask "docker-desktop"       # docker, docker-composeコマンド提供
cask "iterm2"
cask "android-studio"
cask "gitkraken"
cask "github"
cask "postman"
cask "proxyman"
cask "tableplus"
cask "mongodb-compass"
cask "mysqlworkbench"

# AI・生産性
cask "claude"               # Claude AIデスクトップアプリ
cask "notion"
cask "obsidian"
cask "figma"

# デザイン・メディア
cask "altair-graphql-client"
cask "spotify"
cask "adobe-acrobat-reader"

# ユーティリティ
cask "alt-tab"              # Windows風alt-tab
cask "karabiner-elements"   # キーボードカスタマイズ
cask "clipy"                # クリップボード拡張
cask "openinterminal-lite"  # Finderからターミナル起動
cask "openineditor-lite"    # Finderからエディタ起動
cask "balenaetcher"         # OS書き込み
cask "utm"                  # 仮想マシン（QEMU GUI）

# セキュリティ・VPN
cask "nordvpn"
cask "authy"                # 2FA

# Mac固有ツール
cask "sf-symbols"           # macOSシンボルアイコン
cask "logitune"             # Logicool設定

# Microsoft Office
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"

# 【削除候補】以下は検討が必要
# ❓ chatwork - 使ってる？
# ❓ chromedriver - Seleniumテスト用、必要？
# ❓ flotato - Webページをアプリ化、使ってる？
# ❓ flutter - 開発してる？（Nixでも可能）
# ❓ iconset - 使用頻度は？
# ❓ skitch - Evernote製スクショ、使ってる？
# ❓ ssh-tunnel-manager - 使ってる？
# ❓ thunderbird - メールクライアント、使ってる？

cask "chatwork"
cask "chromedriver"
cask "flotato"
cask "flutter"
cask "google-drive"
cask "iconset"
cask "skitch"
cask "ssh-tunnel-manager"
cask "thunderbird"

# ------------------------------------------------------------
# フォント
# ------------------------------------------------------------

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"  # Nix管理と重複だが問題なし
cask "font-noto-mono-for-powerline"
cask "font-ricty-diminished"

# ------------------------------------------------------------
# App Store アプリ
# ------------------------------------------------------------

mas "Amphetamine", id: 937984704         # カフェイン（スリープ防止）
mas "CopyLess 2", id: 993841014          # クリップボード履歴
mas "GarageBand", id: 682658836          # 音楽制作
mas "Goodnotes", id: 1444383602          # ノートアプリ
mas "GoPro Quik", id: 561350520          # GoPro編集
mas "iMovie", id: 408981434              # 動画編集
mas "Keynote", id: 409183694             # プレゼン
mas "Kindle", id: 302584613              # 電子書籍
mas "LINE", id: 539883307                # メッセンジャー
mas "Magnet", id: 441258766              # ウィンドウ配置
mas "Microsoft Remote Desktop", id: 1295203466  # RDP
mas "Numbers", id: 409203825             # 表計算
mas "Pages", id: 409201541               # ワープロ
mas "Paste Plain Text", id: 1407015686   # プレーンテキスト貼り付け
mas "PicGIF Lite", id: 844918735         # GIF作成
mas "Presentify", id: 1507246666         # プレゼン補助
mas "RunCat", id: 1429033973             # CPU使用率表示
mas "Spark", id: 1176895641              # メールクライアント
mas "Xcode", id: 497799835               # iOS開発

# ------------------------------------------------------------
# VS Code 拡張機能（VSCodeが自動管理）
# ------------------------------------------------------------

vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "editorconfig.editorconfig"
vscode "prisma.prisma"
vscode "mhutchie.git-graph"
vscode "github.vscode-pull-request-github"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "dracula-theme.theme-dracula"

# 【削除候補】大量の拡張機能は手動インストール推奨
# Brewfileで管理すると肥大化するため、必須のもののみ残す
