tap "argon/mas"
tap "homebrew/bundle"
tap "homebrew/services"
brew "gnupg"
brew "mas"
brew "pinentry-mac"
cask "1password"
cask "alt-tab"
cask "android-studio"
cask "claude"
cask "claude-code"
cask "clipy"
cask "copilot-cli"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "karabiner-elements"
cask "logitune"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "nordvpn"
cask "notion"
cask "obsidian"
cask "postman"
cask "proxyman"
cask "slack"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "CopyLess 2", id: 993841014
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "GoPro Quik", id: 561350520
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste Plain Text", id: 1407015686
mas "PicGIF Lite", id: 844918735
mas "Presentify", id: 1507246666
mas "RunCat", id: 1429033973
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "mhutchie.git-graph"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "prisma.prisma"
